main_menu = """1. Добавить контакт
2. Удалить контакт
3. Поиск контакта
4. Показать все контакты
5. Изменить контакт
6. Выйти"""

input_choice = "Выберите действие (1-6): "

main_menu_end = "Программа завершена."

main_menu_error = "Неверный выбор. Попробуйте еще раз."

pb_empty = "Телефонный справочник пуст"

pb_all_contact = "Все контакты телефонного справочника:"

pb_all_contact_table = """Телефонный справочник:
--------------------------------------------------------------------------
|  Имя           |  Фамилия     |   Номер        |   Комментарий       |"""

pb_all_contact_divider = "--------------------------------------------------------------------------"

new_contact = {'name': 'Введите имя: ', 'surname': "Введите фамилию: ", 'number': "Введите номер: ",
               'comment': "Введите комментарий: "}

add_new_contact = "Контакт добавлен"

input_del_contact = "Введите имя контакта для удаления: "

del_contact = "Контакт удален"

no_contact = "Контакт не найден"

search_contact = "Введите имя контакта для поиска: "

edit_contact_good = "Контакт успешно изменен"

new_comment = "Введите новый комментарий (оставьте пустым для сохранения текущего): "
new_number = "Введите новый номер (оставьте пустым для сохранения текущего): "
new_surname = "Введите новую фамилию (оставьте пустым для сохранения текущей): "
new_name = "Введите имя контакта для изменения: "
